pimpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0.01;
        preconditioner  DIC;
    }
    
    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        tolerance       1e-05;
        relTol          0.01;
        preconditioner  DILU;
    }
   
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        $U;
        tolerance       1e-06;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 1;
}


relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        ".*"            0.7;
    }
}


// ************************************************************************* //
